In [5]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:%24b00GyP%40sS%5E@localhost/books"
engine = create_engine(connection_str)

Â ERD![png](Data/bookfrd.png)

In [6]:
q= """select * from users"""
pd.read_sql(q,engine)

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       robin@books.com
2        3     Gloria  Rodriguez  grodriguez@books.com

In [14]:
q = """SELECT books.book_title, favorites.user_id
FROM books
JOIN favorites ON books.book_id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.user_id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""


pd.read_sql(q,engine)

         book_title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1